# WinderRunInsideWalklineOffsetFailure Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..WinderRunInsideWalklineOffsetFailure Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Please enter a value between 0 and half of Actual Run Width (%1/2 Actual Run Width%).
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId WinderRunInsideWalklineOffsetFailure { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WinderRunInsideWalklineOffsetFailure As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ WinderRunInsideWalklineOffsetFailure {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace